/*
 * NCR710 SCSI I/O Processor
 *
 * Copyright (c) 2025 Soumyajyotii Ssarkar <soumyajyotisarkar23@gmail.com>
 *
 * NCR710 SCSI I/O Processor implementation
 * Based on the NCR53C710 Technical Manual Version 3.2, December 2000
 *
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "hw/sysbus.h"
#include "hw/scsi/scsi.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "system/dma.h"
#include "exec/address-spaces.h"
#include "migration/vmstate.h"
#include "qemu/log.h"
#include "qemu/timer.h"
#include "trace.h"
#include "qapi/error.h"
#include "hw/scsi/ncr53c710.h"

/* Big Endian addressing - access size is 8-bit for all registers
 * NCR53C710 Register Offsets (from Table 4.1 Register Address Map)
 */
#define NCR710_SCNTL0_REG       0x00    /* SCSI Control Zero */
#define NCR710_SCNTL1_REG       0x01    /* SCSI Control One */
#define NCR710_SDID_REG         0x02    /* SCSI Destination ID */
#define NCR710_SIEN_REG         0x03    /* SCSI Interrupt Enable */
#define NCR710_SCID_REG         0x04    /* SCSI Chip ID */
#define NCR710_SXFER_REG        0x05    /* SCSI Transfer */
#define NCR710_SODL_REG         0x06    /* SCSI Output Data Latch */
#define NCR710_SOCL_REG         0x07    /* SCSI Output Control Latch */

#define SCRIPTS_TYPE_READ_WRITE 0x80000000  /* Read/Write instruction */
#define SCRIPTS_TYPE_TRANSFER   0xC0000000  /* Transfer Control instruction */

/* Block Move instruction bits */
#define SCRIPTS_BM_INDIRECT     0x20000000  /* Indirect addressing */
#define SCRIPTS_BM_TABLE        0x10000000  /* Table indirect addressing */
#define SCRIPTS_BM_OPCODE       0x08000000  /* Opcode: 0=CHMOV, 1=MOVE */
#define SCRIPTS_BM_PHASE_MASK   0x07000000  /* SCSI phase mask */
#define SCRIPTS_BM_COUNT_MASK   0x00FFFFFF  /* Byte count mask */

/* Constants for FIFO sizes */
#define NCR710_DMA_FIFO_SIZE    64
#define NCR710_SCSI_FIFO_SIZE   8

/* I/O instruction opcodes (bits 29:27) */
#define SCRIPTS_IO_OPCODE_MASK  0x38000000
#define SCRIPTS_IO_RESELECT     0x00000000  /* Reselect */
#define SCRIPTS_IO_DISCONNECT   0x08000000  /* Disconnect */
#define SCRIPTS_IO_WAIT_SEL     0x10000000  /* Wait for Select */
#define SCRIPTS_IO_SET          0x18000000  /* Set */
#define SCRIPTS_IO_CLEAR        0x20000000  /* Clear */

/* Transfer Control instruction opcodes (bits 29:27) */
#define SCRIPTS_TC_OPCODE_MASK  0x38000000
#define SCRIPTS_TC_JUMP         0x00000000  /* Jump */
#define SCRIPTS_TC_CALL         0x08000000  /* Call */
#define SCRIPTS_TC_RETURN       0x10000000  /* Return */
#define SCRIPTS_TC_INT          0x18000000  /* Interrupt */

/* SCSI phases */
#define SCSI_PHASE_DATA_OUT     0x00
#define SCSI_PHASE_DATA_IN      0x01
#define SCSI_PHASE_COMMAND      0x02
#define SCSI_PHASE_STATUS       0x03
#define SCSI_PHASE_MSG_OUT      0x06
#define SCSI_PHASE_MSG_IN       0x07

/* FIFO sizes */
#define NCR710_DMA_FIFO_SIZE    64
#define NCR710_SCSI_FIFO_SIZE   8

/* Timing constants */
#define NCR710_SELECTION_TIMEOUT_MS   250
#define NCR710_BUS_SETTLE_DELAY       1200  /* 1.2 µs in ns */

/* Device constants - Based on Linux driver settings */
#define NCR710_VENDOR_ID        0x1000  /* LSI Logic */
#define NCR710_DEVICE_ID        0x0001  /* NCR53C710 */
#define NCR710_REVISION_2       0x20    /* Revision 2 */

/* Default clock frequency (from mvme16x driver) */
#define NCR710_DEFAULT_CLOCK_MHZ    50  /* 50MHz */

/* Driver-specific feature flags (from mvme16x_scsi.c) */
#define NCR710_CHIP710_FLAG     0x0001  /* chip710 = 1 */
#define NCR710_DMODE_FC2        0x02    /* dmode_extra = DMODE_FC2 */
#define NCR710_DCNTL_EA         0x20    /* dcntl_extra = EA_710 */
#define NCR710_CTEST7_TT1       0x02    /* ctest7_extra = CTEST7_TT1 */

/* Host adapter defaults (from Linux driver) */
#define NCR710_DEFAULT_HOST_ID  7       /* Default SCSI ID */

/* Extended CTEST7 bits (from driver) */
#define CTEST7_TT1              0x02    /* Transfer Type 1 */
#define CTEST7_DIFF             0x01    /* Differential SCSI */

/* Extended DCNTL bits (from driver) */
#define DCNTL_EA                0x20    /* Enable Ack */

/* Extended DMODE bits (from driver) */
#define DMODE_FC2               0x02    /* Flow Control 2 */

/* DMA FIFO structure - 64 bytes x 9 bits (4 byte lanes of 16 entries each) */
typedef struct {
    uint8_t data[NCR710_DMA_FIFO_SIZE];
    uint8_t parity[NCR710_DMA_FIFO_SIZE];
    int head;       /* Write pointer */
    int tail;       /* Read pointer */
    int count;      /* Number of valid entries */
} NCR710_DMA_FIFO;

/* SCSI FIFO structure - 8 bytes */
typedef struct {
    uint8_t data[NCR710_SCSI_FIFO_SIZE];
    uint8_t parity[NCR710_SCSI_FIFO_SIZE];
    int count;      /* Number of valid bytes */
} NCR710_SCSI_FIFO;

/* Type aliases for compatibility */
typedef NCR710_DMA_FIFO NCR710_DMA_FIFO;
typedef NCR710_SCSI_FIFO NCR710_SCSI_FIFO;

/* SCRIPTS execution context */
typedef struct {
    bool running;
    uint32_t pc;        /* Current program counter (DSP) */
    uint32_t saved_pc;  /* Saved PC for calls (TEMP) */
    uint8_t phase;      /* Current SCSI phase */
    bool connected;     /* Connected to SCSI bus */
    bool initiator;     /* True if initiator, false if target */
} NCR710_SCRIPTS_Context;

/* Device state structure definitions */
struct NCR710State {
    DeviceState parent_obj;

    /* Memory regions */
    MemoryRegion mmio;
    MemoryRegion ram;

    /* SCSI bus */
    SCSIBus bus;

    /* SCSI Core Registers (0x00-0x0F) */
    uint8_t scntl0;             /* 0x00 SCSI Control Zero */
    uint8_t scntl1;             /* 0x01 SCSI Control One */
    uint8_t sdid;               /* 0x02 SCSI Destination ID */
    uint8_t sien;               /* 0x03 SCSI Interrupt Enable */
    uint8_t scid;               /* 0x04 SCSI Chip ID */
    uint8_t sxfer;              /* 0x05 SCSI Transfer */
    uint8_t sodl;               /* 0x06 SCSI Output Data Latch */
    uint8_t socl;               /* 0x07 SCSI Output Control Latch */
    uint8_t sfbr;               /* 0x08 SCSI First Byte Received */
    uint8_t sidl;               /* 0x09 SCSI Input Data Latch */
    uint8_t sbdl;               /* 0x0A SCSI Bus Data Lines */
    uint8_t sbcl;               /* 0x0B SCSI Bus Control Lines */

    /* DMA Core and Status Registers (0x10-0x13) */
    uint8_t dstat;              /* 0x14 DMA Status */
    uint8_t sstat0;             /* 0x15 SCSI Status 0 */
    uint8_t sstat1;             /* 0x16 SCSI Status 1 */
    uint8_t sstat2;             /* 0x17 SCSI Status 2 */

    /* DMA Registers (0x18-0x3F) */
    uint32_t dsa;               /* 0x10 Data Structure Address */
    uint8_t istat;              /* 0x14 Interrupt Status */
    uint32_t dbc;               /* 0x18 DMA Byte Counter */
    uint8_t dcmd;               /* 0x1B DMA Command */
    uint32_t dnad;              /* 0x1C DMA Next Address for Data */
    uint32_t dsp;               /* 0x20 DMA SCRIPTS Pointer */
    uint32_t dsps;              /* 0x24 DMA SCRIPTS Pointer Save */
    uint32_t scratch;           /* 0x28-0x2B Scratch Registers A-D */
    uint8_t dmode;              /* 0x38 DMA Mode */
    uint8_t dien;               /* 0x39 DMA Interrupt Enable */
    uint8_t dwt;                /* 0x3A DMA Watchdog Timer */
    uint8_t dcntl;              /* 0x3B DMA Control */
    uint32_t adder;             /* 0x3C Adder Sum Output */

    /* Additional test registers */
    uint8_t ctest0, ctest1, ctest2, ctest3, ctest4, ctest5, ctest6, ctest7;
    uint8_t dfifo;              /* DMA FIFO */
    uint8_t ctest8;             /* Chip Test 8 */
    uint8_t lcrc;               /* Longitudinal Parity */
    uint32_t temp;              /* Temporary register */

    /* Internal FIFOs */
    NCR710_DMA_FIFO dma_fifo;
    NCR710_SCSI_FIFO scsi_fifo;

    /* SCRIPTS execution context */
    NCR710_SCRIPTS_Context scripts;

    /* Current SCSI operation state */
    SCSIRequest *current_req;
    uint8_t *current_dma_buf;
    uint32_t current_dma_len;
    uint8_t current_scsi_phase;
    bool selection_timeout_enabled;

    /* Timers */
    QEMUTimer *selection_timer;
    QEMUTimer *watchdog_timer;

    /* IRQ line */
    qemu_irq irq;

    /* Host memory access */
    AddressSpace *as;

    /* Bus mode and endianness */
    bool big_endian;
